# स्रोत: https://eddmann.com/posts/depth-first-search-and-breadth-first-search-in-python/

ग्राफ = {'क': संग्रह(['ख', 'ग']),
         'ख': संग्रह(['क', 'घ', 'ङ']),
         'ग': संग्रह(['क', 'च']),
         'घ': संग्रह(['ख']),
         'ङ': संग्रह(['ख', 'च']),
         'च': संग्रह(['ग', 'ङ'])}

परिभाषा गहराई_पहले_खोज(ग्राफ, शुरू):
    जा_चुका_हु, ढेर = संग्रह(), [शुरू]
    जब तक ढेर:
        किनेरा = ढेर.निकालो()
        अगर किनेरा नहीं अंदर जा_चुका_हु:
            जा_चुका_हु.डालो(किनेरा)
            ढेर.विस्तार(ग्राफ[किनेरा] - जा_चुका_हु)
    अर्थ जा_चुका_हु

प्रिंट(गहराई_पहले_खोज(ग्राफ, 'क'))
