श्रेणी चलचित्र:
	परिभाषा __स्थापना__(स्वयं, नाम):
		स्वयं.नाम = नाम
		स्वयं.आईडी = हैश(नाम)

श्रेणी मानव:
	परिभाषा __स्थापना__(स्वयं, नाम, पसंद=अशक्त):
		स्वयं.नाम = नाम
		स्वयं.पसंद = संग्रह()
		स्वयं.पसंद_आईडी = संग्रह()

	परिभाषा पसंद_में(स्वयं, फिल्म):
		स्वयं.पसंद.डालो(फिल्म.नाम)
		स्वयं.पसंद_आईडी.डालो(फिल्म.आईडी)

	परिभाषा पसंदे(स्वयं):
		अर्थ स्वयं.पसंद

क3ग = चलचित्र('कबी खुशी कभि गम')

राजेश = मानव('राजेश')

राजेश.पसंद_में(क3ग)
राजेश.पसंद_में(चलचित्र('रंग दे बसंती'))
प्रिंट(राजेश.पसंदे())
